Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_usart3.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32L4R5_usart3 equates.
 */

#pragma once

#include    <stdint.h>

// USART3 address definitions
// --------------------------

typedef struct {
        union {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR1_ALTERNATE;
        };
    volatile    uint32_t    CR2;
    volatile    uint32_t    CR3;
    volatile    uint32_t    BRR;
    volatile    uint32_t    GTPR;
    volatile    uint32_t    RTOR;
    volatile    uint32_t    RQR;
        union {
    volatile    uint32_t    ISR;
    volatile    uint32_t    ISR_ALTERNATE;
        };
    volatile    uint32_t    ICR;
    volatile    uint32_t    RDR;
    volatile    uint32_t    TDR;
    volatile    uint32_t    PRESC;
} USART3_TypeDef;

#ifdef __cplusplus
#define USART3  reinterpret_cast<USART3_TypeDef *>(0x40004800U)

#else
#define USART3  ((USART3_TypeDef *)0x40004800U)
#endif

// CR1 Configuration

#define USART3_CR1_RXFFIE                   (0x1U<<31)
#define USART3_CR1_TXFEIE                   (0x1U<<30)
#define USART3_CR1_FIFOEN                   (0x1U<<29)
#define USART3_CR1_M1                       (0x1U<<28)
#define USART3_CR1_EOBIE                    (0x1U<<27)
#define USART3_CR1_RTOIE                    (0x1U<<26)
#define USART3_CR1_DEAT                     (0x1FU<<21)
#define USART3_CR1_DEAT_0                   (0x1U<<21)
#define USART3_CR1_DEDT                     (0x1FU<<16)
#define USART3_CR1_DEDT_0                   (0x1U<<16)
#define USART3_CR1_OVER8                    (0x1U<<15)
#define USART3_CR1_CMIE                     (0x1U<<14)
#define USART3_CR1_MME                      (0x1U<<13)
#define USART3_CR1_M0                       (0x1U<<12)
#define USART3_CR1_WAKE                     (0x1U<<11)
#define USART3_CR1_PCE                      (0x1U<<10)
#define USART3_CR1_PS                       (0x1U<<9)
#define USART3_CR1_PEIE                     (0x1U<<8)
#define USART3_CR1_TXFNFIE                  (0x1U<<7)
#define USART3_CR1_TCIE                     (0x1U<<6)
#define USART3_CR1_RXFNEIE                  (0x1U<<5)
#define USART3_CR1_IDLEIE                   (0x1U<<4)
#define USART3_CR1_TE                       (0x1U<<3)
#define USART3_CR1_RE                       (0x1U<<2)
#define USART3_CR1_UESM                     (0x1U<<1)
#define USART3_CR1_UE                       (0x1U<<0)
#define USART3_CR1_RXFFIE_B_0X0             (0x0U<<31)
#define USART3_CR1_RXFFIE_B_0X1             (0x1U<<31)
#define USART3_CR1_TXFEIE_B_0X0             (0x0U<<30)
#define USART3_CR1_TXFEIE_B_0X1             (0x1U<<30)
#define USART3_CR1_FIFOEN_B_0X0             (0x0U<<29)
#define USART3_CR1_FIFOEN_B_0X1             (0x1U<<29)
#define USART3_CR1_EOBIE_B_0X0              (0x0U<<27)
#define USART3_CR1_EOBIE_B_0X1              (0x1U<<27)
#define USART3_CR1_RTOIE_B_0X0              (0x0U<<26)
#define USART3_CR1_RTOIE_B_0X1              (0x1U<<26)
#define USART3_CR1_OVER8_B_0X0              (0x0U<<15)
#define USART3_CR1_OVER8_B_0X1              (0x1U<<15)
#define USART3_CR1_CMIE_B_0X0               (0x0U<<14)
#define USART3_CR1_CMIE_B_0X1               (0x1U<<14)
#define USART3_CR1_MME_B_0X0                (0x0U<<13)
#define USART3_CR1_MME_B_0X1                (0x1U<<13)
#define USART3_CR1_WAKE_B_0X0               (0x0U<<11)
#define USART3_CR1_WAKE_B_0X1               (0x1U<<11)
#define USART3_CR1_PCE_B_0X0                (0x0U<<10)
#define USART3_CR1_PCE_B_0X1                (0x1U<<10)
#define USART3_CR1_PS_B_0X0                 (0x0U<<9)
#define USART3_CR1_PS_B_0X1                 (0x1U<<9)
#define USART3_CR1_PEIE_B_0X0               (0x0U<<8)
#define USART3_CR1_PEIE_B_0X1               (0x1U<<8)
#define USART3_CR1_TXFNFIE_B_0X0            (0x0U<<7)
#define USART3_CR1_TXFNFIE_B_0X1            (0x1U<<7)
#define USART3_CR1_TCIE_B_0X0               (0x0U<<6)
#define USART3_CR1_TCIE_B_0X1               (0x1U<<6)
#define USART3_CR1_RXFNEIE_B_0X0            (0x0U<<5)
#define USART3_CR1_RXFNEIE_B_0X1            (0x1U<<5)
#define USART3_CR1_IDLEIE_B_0X0             (0x0U<<4)
#define USART3_CR1_IDLEIE_B_0X1             (0x1U<<4)
#define USART3_CR1_TE_B_0X0                 (0x0U<<3)
#define USART3_CR1_TE_B_0X1                 (0x1U<<3)
#define USART3_CR1_RE_B_0X0                 (0x0U<<2)
#define USART3_CR1_RE_B_0X1                 (0x1U<<2)
#define USART3_CR1_UESM_B_0X0               (0x0U<<1)
#define USART3_CR1_UESM_B_0X1               (0x1U<<1)
#define USART3_CR1_UE_B_0X0                 (0x0U<<0)
#define USART3_CR1_UE_B_0X1                 (0x1U<<0)

// CR1_ALTERNATE Configuration

#define USART3_CR1_ALTERNATE_FIFOEN         (0x1U<<29)
#define USART3_CR1_ALTERNATE_M1             (0x1U<<28)
#define USART3_CR1_ALTERNATE_EOBIE          (0x1U<<27)
#define USART3_CR1_ALTERNATE_RTOIE          (0x1U<<26)
#define USART3_CR1_ALTERNATE_DEAT           (0x1FU<<21)
#define USART3_CR1_ALTERNATE_DEAT_0         (0x1U<<21)
#define USART3_CR1_ALTERNATE_DEDT           (0x1FU<<16)
#define USART3_CR1_ALTERNATE_DEDT_0         (0x1U<<16)
#define USART3_CR1_ALTERNATE_OVER8          (0x1U<<15)
#define USART3_CR1_ALTERNATE_CMIE           (0x1U<<14)
#define USART3_CR1_ALTERNATE_MME            (0x1U<<13)
#define USART3_CR1_ALTERNATE_M0             (0x1U<<12)
#define USART3_CR1_ALTERNATE_WAKE           (0x1U<<11)
#define USART3_CR1_ALTERNATE_PCE            (0x1U<<10)
#define USART3_CR1_ALTERNATE_PS             (0x1U<<9)
#define USART3_CR1_ALTERNATE_PEIE           (0x1U<<8)
#define USART3_CR1_ALTERNATE_TXEIE          (0x1U<<7)
#define USART3_CR1_ALTERNATE_TCIE           (0x1U<<6)
#define USART3_CR1_ALTERNATE_RXNEIE         (0x1U<<5)
#define USART3_CR1_ALTERNATE_IDLEIE         (0x1U<<4)
#define USART3_CR1_ALTERNATE_TE             (0x1U<<3)
#define USART3_CR1_ALTERNATE_RE             (0x1U<<2)
#define USART3_CR1_ALTERNATE_UESM           (0x1U<<1)
#define USART3_CR1_ALTERNATE_UE             (0x1U<<0)
#define USART3_CR1_ALTERNATE_FIFOEN_B_0X0   (0x0U<<29)
#define USART3_CR1_ALTERNATE_FIFOEN_B_0X1   (0x1U<<29)
#define USART3_CR1_ALTERNATE_EOBIE_B_0X0    (0x0U<<27)
#define USART3_CR1_ALTERNATE_EOBIE_B_0X1    (0x1U<<27)
#define USART3_CR1_ALTERNATE_RTOIE_B_0X0    (0x0U<<26)
#define USART3_CR1_ALTERNATE_RTOIE_B_0X1    (0x1U<<26)
#define USART3_CR1_ALTERNATE_OVER8_B_0X0    (0x0U<<15)
#define USART3_CR1_ALTERNATE_OVER8_B_0X1    (0x1U<<15)
#define USART3_CR1_ALTERNATE_CMIE_B_0X0     (0x0U<<14)
#define USART3_CR1_ALTERNATE_CMIE_B_0X1     (0x1U<<14)
#define USART3_CR1_ALTERNATE_MME_B_0X0      (0x0U<<13)
#define USART3_CR1_ALTERNATE_MME_B_0X1      (0x1U<<13)
#define USART3_CR1_ALTERNATE_WAKE_B_0X0     (0x0U<<11)
#define USART3_CR1_ALTERNATE_WAKE_B_0X1     (0x1U<<11)
#define USART3_CR1_ALTERNATE_PCE_B_0X0      (0x0U<<10)
#define USART3_CR1_ALTERNATE_PCE_B_0X1      (0x1U<<10)
#define USART3_CR1_ALTERNATE_PS_B_0X0       (0x0U<<9)
#define USART3_CR1_ALTERNATE_PS_B_0X1       (0x1U<<9)
#define USART3_CR1_ALTERNATE_PEIE_B_0X0     (0x0U<<8)
#define USART3_CR1_ALTERNATE_PEIE_B_0X1     (0x1U<<8)
#define USART3_CR1_ALTERNATE_TXEIE_B_0X0    (0x0U<<7)
#define USART3_CR1_ALTERNATE_TXEIE_B_0X1    (0x1U<<7)
#define USART3_CR1_ALTERNATE_TCIE_B_0X0     (0x0U<<6)
#define USART3_CR1_ALTERNATE_TCIE_B_0X1     (0x1U<<6)
#define USART3_CR1_ALTERNATE_RXNEIE_B_0X0   (0x0U<<5)
#define USART3_CR1_ALTERNATE_RXNEIE_B_0X1   (0x1U<<5)
#define USART3_CR1_ALTERNATE_IDLEIE_B_0X0   (0x0U<<4)
#define USART3_CR1_ALTERNATE_IDLEIE_B_0X1   (0x1U<<4)
#define USART3_CR1_ALTERNATE_TE_B_0X0       (0x0U<<3)
#define USART3_CR1_ALTERNATE_TE_B_0X1       (0x1U<<3)
#define USART3_CR1_ALTERNATE_RE_B_0X0       (0x0U<<2)
#define USART3_CR1_ALTERNATE_RE_B_0X1       (0x1U<<2)
#define USART3_CR1_ALTERNATE_UESM_B_0X0     (0x0U<<1)
#define USART3_CR1_ALTERNATE_UESM_B_0X1     (0x1U<<1)
#define USART3_CR1_ALTERNATE_UE_B_0X0       (0x0U<<0)
#define USART3_CR1_ALTERNATE_UE_B_0X1       (0x1U<<0)

// CR2 Configuration

#define USART3_CR2_ADD                      (0xFFU<<24)
#define USART3_CR2_ADD_0                    (0x1U<<24)
#define USART3_CR2_RTOEN                    (0x1U<<23)
#define USART3_CR2_ABRMOD                   (0x3U<<21)
#define USART3_CR2_ABRMOD_0                 (0x1U<<21)
#define USART3_CR2_ABREN                    (0x1U<<20)
#define USART3_CR2_MSBFIRST                 (0x1U<<19)
#define USART3_CR2_DATAINV                  (0x1U<<18)
#define USART3_CR2_TXINV                    (0x1U<<17)
#define USART3_CR2_RXINV                    (0x1U<<16)
#define USART3_CR2_SWAP                     (0x1U<<15)
#define USART3_CR2_LINEN                    (0x1U<<14)
#define USART3_CR2_STOP                     (0x3U<<12)
#define USART3_CR2_STOP_0                   (0x1U<<12)
#define USART3_CR2_CLKEN                    (0x1U<<11)
#define USART3_CR2_CPOL                     (0x1U<<10)
#define USART3_CR2_CPHA                     (0x1U<<9)
#define USART3_CR2_LBCL                     (0x1U<<8)
#define USART3_CR2_LBDIE                    (0x1U<<6)
#define USART3_CR2_LBDL                     (0x1U<<5)
#define USART3_CR2_ADDM7                    (0x1U<<4)
#define USART3_CR2_DIS_NSS                  (0x1U<<3)
#define USART3_CR2_SLVEN                    (0x1U<<0)
#define USART3_CR2_RTOEN_B_0X0              (0x0U<<23)
#define USART3_CR2_RTOEN_B_0X1              (0x1U<<23)
#define USART3_CR2_ABRMOD_B_0X0             (0x0U<<21)
#define USART3_CR2_ABRMOD_B_0X1             (0x1U<<21)
#define USART3_CR2_ABRMOD_B_0X2             (0x2U<<21)
#define USART3_CR2_ABRMOD_B_0X3             (0x3U<<21)
#define USART3_CR2_ABREN_B_0X0              (0x0U<<20)
#define USART3_CR2_ABREN_B_0X1              (0x1U<<20)
#define USART3_CR2_MSBFIRST_B_0X0           (0x0U<<19)
#define USART3_CR2_MSBFIRST_B_0X1           (0x1U<<19)
#define USART3_CR2_DATAINV_B_0X0            (0x0U<<18)
#define USART3_CR2_DATAINV_B_0X1            (0x1U<<18)
#define USART3_CR2_TXINV_B_0X0              (0x0U<<17)
#define USART3_CR2_TXINV_B_0X1              (0x1U<<17)
#define USART3_CR2_RXINV_B_0X0              (0x0U<<16)
#define USART3_CR2_RXINV_B_0X1              (0x1U<<16)
#define USART3_CR2_SWAP_B_0X0               (0x0U<<15)
#define USART3_CR2_SWAP_B_0X1               (0x1U<<15)
#define USART3_CR2_LINEN_B_0X0              (0x0U<<14)
#define USART3_CR2_LINEN_B_0X1              (0x1U<<14)
#define USART3_CR2_STOP_B_0X0               (0x0U<<12)
#define USART3_CR2_STOP_B_0X1               (0x1U<<12)
#define USART3_CR2_STOP_B_0X2               (0x2U<<12)
#define USART3_CR2_STOP_B_0X3               (0x3U<<12)
#define USART3_CR2_CLKEN_B_0X0              (0x0U<<11)
#define USART3_CR2_CLKEN_B_0X1              (0x1U<<11)
#define USART3_CR2_CPOL_B_0X0               (0x0U<<10)
#define USART3_CR2_CPOL_B_0X1               (0x1U<<10)
#define USART3_CR2_CPHA_B_0X0               (0x0U<<9)
#define USART3_CR2_CPHA_B_0X1               (0x1U<<9)
#define USART3_CR2_LBCL_B_0X0               (0x0U<<8)
#define USART3_CR2_LBCL_B_0X1               (0x1U<<8)
#define USART3_CR2_LBDIE_B_0X0              (0x0U<<6)
#define USART3_CR2_LBDIE_B_0X1              (0x1U<<6)
#define USART3_CR2_LBDL_B_0X0               (0x0U<<5)
#define USART3_CR2_LBDL_B_0X1               (0x1U<<5)
#define USART3_CR2_ADDM7_B_0X0              (0x0U<<4)
#define USART3_CR2_ADDM7_B_0X1              (0x1U<<4)
#define USART3_CR2_DIS_NSS_B_0X0            (0x0U<<3)
#define USART3_CR2_DIS_NSS_B_0X1            (0x1U<<3)
#define USART3_CR2_SLVEN_B_0X0              (0x0U<<0)
#define USART3_CR2_SLVEN_B_0X1              (0x1U<<0)

// CR3 Configuration

#define USART3_CR3_TXFTCFG                  (0x7U<<29)
#define USART3_CR3_TXFTCFG_0                (0x1U<<29)
#define USART3_CR3_RXFTIE                   (0x1U<<28)
#define USART3_CR3_RXFTCFG                  (0x7U<<25)
#define USART3_CR3_RXFTCFG_0                (0x1U<<25)
#define USART3_CR3_TCBGTIE                  (0x1U<<24)
#define USART3_CR3_TXFTIE                   (0x1U<<23)
#define USART3_CR3_WUFIE                    (0x1U<<22)
#define USART3_CR3_WUS                      (0x3U<<20)
#define USART3_CR3_WUS_0                    (0x1U<<20)
#define USART3_CR3_SCARCNT                  (0x7U<<17)
#define USART3_CR3_SCARCNT_0                (0x1U<<17)
#define USART3_CR3_DEP                      (0x1U<<15)
#define USART3_CR3_DEM                      (0x1U<<14)
#define USART3_CR3_DDRE                     (0x1U<<13)
#define USART3_CR3_OVRDIS                   (0x1U<<12)
#define USART3_CR3_ONEBIT                   (0x1U<<11)
#define USART3_CR3_CTSIE                    (0x1U<<10)
#define USART3_CR3_CTSE                     (0x1U<<9)
#define USART3_CR3_RTSE                     (0x1U<<8)
#define USART3_CR3_DMAT                     (0x1U<<7)
#define USART3_CR3_DMAR                     (0x1U<<6)
#define USART3_CR3_SCEN                     (0x1U<<5)
#define USART3_CR3_NACK                     (0x1U<<4)
#define USART3_CR3_HDSEL                    (0x1U<<3)
#define USART3_CR3_IRLP                     (0x1U<<2)
#define USART3_CR3_IREN                     (0x1U<<1)
#define USART3_CR3_EIE                      (0x1U<<0)
#define USART3_CR3_TXFTCFG_B_0X0            (0x0U<<29)
#define USART3_CR3_TXFTCFG_B_0X1            (0x1U<<29)
#define USART3_CR3_TXFTCFG_B_0X2            (0x2U<<29)
#define USART3_CR3_TXFTCFG_B_0X3            (0x3U<<29)
#define USART3_CR3_TXFTCFG_B_0X4            (0x4U<<29)
#define USART3_CR3_TXFTCFG_B_0X5            (0x5U<<29)
#define USART3_CR3_RXFTIE_B_0X0             (0x0U<<28)
#define USART3_CR3_RXFTIE_B_0X1             (0x1U<<28)
#define USART3_CR3_RXFTCFG_B_0X0            (0x0U<<25)
#define USART3_CR3_RXFTCFG_B_0X1            (0x1U<<25)
#define USART3_CR3_RXFTCFG_B_0X2            (0x2U<<25)
#define USART3_CR3_RXFTCFG_B_0X3            (0x3U<<25)
#define USART3_CR3_RXFTCFG_B_0X4            (0x4U<<25)
#define USART3_CR3_RXFTCFG_B_0X5            (0x5U<<25)
#define USART3_CR3_TCBGTIE_B_0X0            (0x0U<<24)
#define USART3_CR3_TCBGTIE_B_0X1            (0x1U<<24)
#define USART3_CR3_TXFTIE_B_0X0             (0x0U<<23)
#define USART3_CR3_TXFTIE_B_0X1             (0x1U<<23)
#define USART3_CR3_WUFIE_B_0X0              (0x0U<<22)
#define USART3_CR3_WUFIE_B_0X1              (0x1U<<22)
#define USART3_CR3_WUS_B_0X0                (0x0U<<20)
#define USART3_CR3_WUS_B_0X2                (0x2U<<20)
#define USART3_CR3_WUS_B_0X3                (0x3U<<20)
#define USART3_CR3_SCARCNT_B_0X0            (0x0U<<17)
#define USART3_CR3_DEP_B_0X0                (0x0U<<15)
#define USART3_CR3_DEP_B_0X1                (0x1U<<15)
#define USART3_CR3_DEM_B_0X0                (0x0U<<14)
#define USART3_CR3_DEM_B_0X1                (0x1U<<14)
#define USART3_CR3_DDRE_B_0X0               (0x0U<<13)
#define USART3_CR3_DDRE_B_0X1               (0x1U<<13)
#define USART3_CR3_OVRDIS_B_0X0             (0x0U<<12)
#define USART3_CR3_OVRDIS_B_0X1             (0x1U<<12)
#define USART3_CR3_ONEBIT_B_0X0             (0x0U<<11)
#define USART3_CR3_ONEBIT_B_0X1             (0x1U<<11)
#define USART3_CR3_CTSIE_B_0X0              (0x0U<<10)
#define USART3_CR3_CTSIE_B_0X1              (0x1U<<10)
#define USART3_CR3_CTSE_B_0X0               (0x0U<<9)
#define USART3_CR3_CTSE_B_0X1               (0x1U<<9)
#define USART3_CR3_RTSE_B_0X0               (0x0U<<8)
#define USART3_CR3_RTSE_B_0X1               (0x1U<<8)
#define USART3_CR3_DMAT_B_0X1               (0x1U<<7)
#define USART3_CR3_DMAT_B_0X0               (0x0U<<7)
#define USART3_CR3_DMAR_B_0X1               (0x1U<<6)
#define USART3_CR3_DMAR_B_0X0               (0x0U<<6)
#define USART3_CR3_SCEN_B_0X0               (0x0U<<5)
#define USART3_CR3_SCEN_B_0X1               (0x1U<<5)
#define USART3_CR3_NACK_B_0X0               (0x0U<<4)
#define USART3_CR3_NACK_B_0X1               (0x1U<<4)
#define USART3_CR3_HDSEL_B_0X0              (0x0U<<3)
#define USART3_CR3_HDSEL_B_0X1              (0x1U<<3)
#define USART3_CR3_IRLP_B_0X0               (0x0U<<2)
#define USART3_CR3_IRLP_B_0X1               (0x1U<<2)
#define USART3_CR3_IREN_B_0X0               (0x0U<<1)
#define USART3_CR3_IREN_B_0X1               (0x1U<<1)
#define USART3_CR3_EIE_B_0X0                (0x0U<<0)
#define USART3_CR3_EIE_B_0X1                (0x1U<<0)

// BRR Configuration

#define USART3_BRR_BRR                      (0xFFFFU<<0)
#define USART3_BRR_BRR_0                    (0x1U<<0)

// GTPR Configuration

#define USART3_GTPR_GT                      (0xFFU<<8)
#define USART3_GTPR_GT_0                    (0x1U<<8)
#define USART3_GTPR_PSC                     (0xFFU<<0)
#define USART3_GTPR_PSC_0                   (0x1U<<0)
#define USART3_GTPR_PSC_B_0X0               (0x0U<<0)
#define USART3_GTPR_PSC_B_0X1               (0x1U<<0)
#define USART3_GTPR_PSC_B_0X2               (0x2U<<0)
#define USART3_GTPR_PSC_B_0X3               (0x3U<<0)
#define USART3_GTPR_PSC_B_0X1F              (0x1FU<<0)
#define USART3_GTPR_PSC_B_0X20              (0x20U<<0)
#define USART3_GTPR_PSC_B_0XFF              (0xFFU<<0)

// RTOR Configuration

